Repository: TokcDK/TranslationHelper
Catalog: Current/Main/Locale/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Last group
ru_ru: Последняя группа

source: Extracted with
ru_ru: Извлечено с помощью

source: Variable>Must be Identical in all files>Only A-Za-z0-9
ru_ru: Переменная>Должно быть Идентично во всех файлах>Только A-Za-z0-9

source: Found already extracted files in work dir. Continue with them?
ru_ru: Найдены уже распакованные файлы в рабочей папке. Продолжить с ними?

source: Found extracted files
ru_ru: Найдены распакованные файлы

source: GameFont. Value in Translation field must be exist font css file name or path. If it is exists, it will be copied into %GAME%\www\fonts\. If value is font file name, it will be searching in system fonts folder location.Useful to change font when need to reduce size of text in game if need.Examples:browa.ttf c:/windows/fonts/browa.ttf %LocalAppData%/Microsoft/Windows/Fonts/browa.ttf
ru_ru: Игровой шрифт Значение в поле Перевод должно быть именем существующего файла шрифта или путем к нему. Если шрифт найден, он будет скопирован в папку %GAME%\www\fonts\. Если значение это имя файла, будет поиск его в папках шрифтов системы. Полезно изменять шрифт, когда нужно уменьшить размер текста в игре. Примеры: browa.ttf c:/windows/fonts/browa.ttf %LocalAppData%/Microsoft/Windows/Fonts/browa.ttf --------------

source: Warning
ru_ru: Внимание

source: Parameter: translation of some parameters can break the game.
ru_ru: Параметр: перевод некоторых параметров может сломать игру.

source: Writing
ru_ru: Запись

source: games
ru_ru: игры

source: Translation Helper by DenisK (c) ????(pregit)-2019-2020
ru_ru: Translation Helper от DenisK (c) ????(pregit)-2019-2023

source: Utility which helps in translation of some RPGMaker and other games.
ru_ru: Утилита, которая помогает в переводе некоторых RPGMaker и прочих игр.

source: It is merge of some my utilities which was made for help with games translation.
ru_ru: Утилита для помощи в переводе.

source: Currently can help to translate:
ru_ru: В настоящее время может помочь с переводом:

source: RPG Maker Trans Patch and supported games by it
ru_ru: RPG Maker Trans Patch и игры поддерживаемые им

source: Some standalone
ru_ru: Некоторые другие

source: Credits
ru_ru: Благодарности

source: File
ru_ru: Файл

source: Open
ru_ru: Открыть

source: Write translation
ru_ru: Записать перевод

source: Save translation
ru_ru: Сохранить перевод

source: Save Translation as
ru_ru: Сохранить перевод как

source: Load Translation
ru_ru: Загрузить перевод

source: Load Translation as
ru_ru: Загрузить перевод как

source: forced
ru_ru: принудительно

source: Test
ru_ru: Тест

source: Edit
ru_ru: Правка

source: Open in Web
ru_ru: Открыть в Web

source: Translate Online
ru_ru: Онлайн-перевод

source: Selected
ru_ru: Выбраное

source: Table
ru_ru: Таблица

source: All
ru_ru: Все

source: Interupt
ru_ru: Прервать

source: Fix cell special symbols
ru_ru: Исправить спецсимволы

source: Translation=Original
ru_ru: Перевод=Оригинал

source: Complete Romaji/Other lines
ru_ru: Завершить ромаджи/прочие строки

source: Force same for simular
ru_ru: Автоперевод для похожих (все)

source: Cut
ru_ru: Вырезать

source: Copy
ru_ru: Копировать

source: Paste
ru_ru: Вставить

source: Clear selected cells
ru_ru: Очистить выбранные

source: UPPERCASE
ru_ru: ВЕРХНИЙ

source: Uppercase
ru_ru: Верхний

source: lowercase
ru_ru: нижний

source: Search
ru_ru: Поиск

source: View
ru_ru: Вид

source: Reset column sorting
ru_ru: Сброс сортировки колонок

source: Options
ru_ru: Опции

source: Settings
ru_ru: Настройки

source: Help
ru_ru: Помощь

source: About
ru_ru: О программе

source: Open in web
ru_ru: Открыть в Web

source: Resets filters and tab sorting
ru_ru: Сбрасывает фильтры и сортировку столбцов

source: Filters for columns of main table
ru_ru: Фильтры для колонок главной таблицы

source: Shows overal number of completed lines. Click to show first untranslated.
ru_ru: Отображает общее число переведенных строк. Нажмите для выбора первой непереведенной.

source: Original
ru_ru: Оригинал

source: Translation
ru_ru: Перевод

source: rowinfo:
ru_ru: информация о строке:

source: Selected bytes length
ru_ru: Длина выбранного в байтах

source: Several strings also can be in Plugins.js in 'www\js' folder and referred plugins in plugins folder.
ru_ru: Некоторые строки также могут быть в файле Plugins.js в папке 'www\js' и ссылаемых плагинах папки plugins.

source: working..
ru_ru: работаю..

source: Saving
ru_ru: Сохранение

source: DB not found. Try to load from all exist?
ru_ru: БД не найдена. Попробовать загрузить все существующие?

source: DB not found
ru_ru: БД не найдена.

source: Reading DB File
ru_ru: Чтение файла БД

source: Loading
ru_ru: Загрузка

source: Static translations
ru_ru: Статический перевод

source: Find and Replace
ru_ru: Поиск и замена

source: Search Mode
ru_ru: Режим поиска

source: Normal
ru_ru: Нормальный

source: Range
ru_ru: Диапазон

source: Anywhere
ru_ru: Везде

source: Method
ru_ru: Метод

source: Find in Original and Paste to Translation
ru_ru: Поиск в Оригинале и вставка в Перевод

source: Find and Replace in Translation
ru_ru: Поиск и замена в переводе

source: Match Case
ru_ru: Учитывать регистр

source: Find All
ru_ru: Искать все

source: Find Next
ru_ru: Искать далее

source: Replace
ru_ru: Заменить

source: Replace All
ru_ru: Заменить все

source: Find what:
ru_ru: Искать:

source: Replace with:
ru_ru: Заменить на:

source: Found
ru_ru: Найдено

source: records
ru_ru: записей

source: Nothing Found
ru_ru: Ничего не найдено

source: Invalid regex
ru_ru: Неверный регекс

source: Nothing Found.
ru_ru: Ничего не найдено

source: Confirmation
ru_ru: Подтверждение

source: Full recursive scan while translation DB loading (slower)
ru_ru: Рекурсивное сканирование при загрузке БД перевода (медленнее)

source: char limit of line length (for line split functions)
ru_ru: Лимит букв для строки (для разбиения строк)

source: General
ru_ru: Основные

source: Optimizations
ru_ru: Оптимизация

source: Compression for DB files:
ru_ru: Сжатие для файлов БД:

source: Do not load string if it has more of next romaji percent -
ru_ru: Не грузить строку, если процент romaji больше -

source: Tools
ru_ru: Инструменты

source: Autotranslation for simular
ru_ru: Автоперевод для похожих

source: Enable online translation cache.
ru_ru: Кеш онлайн-перевода.

source: Web service link for manual translation (F12):
ru_ru: Ссылка на Web-сервис для ручного перевода (F12):

source: In time of DB loading will be checked all DB lines for each line of table for translation.
ru_ru: При загрузке перевода будет проверяться вся БД для каждой строки таблицы. Полезно, к примеру, при загрузке перевода из других БД.

source: String will not be loaded for translation if this string contains romaji characters in text more of specified percent.
ru_ru: Строка не будет загружена для перевода, если содержит ромаджи символы более указанного процента.

source: Format for DB files: standard not compressed xml and compressed xml for both other
ru_ru: Формат файлов БД: xml без сжатия и сжатый xml для двух других

source: Automatically will be translated all almost identical cells with same original.
ru_ru: Автоматически будут переведены все наиболее похожие строки с таким же оригиналом.

source: Will save online translation result in cache db to use it in next time for same values instead of attemp to connect to service.
ru_ru: Сохранит онлайн-перевод в БД кеша для использования в следующий раз для таких же строк, вместо попыток подключиться к сервису.

source: Web site which wil be opened by pressing F12 key with added selected table cells values. Can be any here Google, Yandex, DeepL or other.
ru_ru: Веб-сайт, который будет открыт нажатием F12, с добавлением выбранных значений ячеек. Можно добавить что угодно здесь^ Google, Yandex, DeepL и прочие.

source: Error in
ru_ru: Ошибка в

source: Translation cache disabled but load all DB enabled. While all DB loading cache can be enabled in settings. Load all DB?
ru_ru: Кеш перевода отключен но загрузка всех БД включена. Пока все БД грузятся, кеш может быть включен в настройках. Загрузить все БД?

source: Translation cache disabled
ru_ru: Кеш перевода отключен

source: Project
ru_ru: Проект

source: Select cell first
ru_ru: Сначала выберете ячейки

source: Load
ru_ru: Загрузка

source: Found translation DB. Load it?
ru_ru: Найдена БД перевода. Загрузить?

source: Load translation DB
ru_ru: Загрузить БД перевода

source: Try to find translations in all avalaible DB? (Can take some time)
ru_ru: Попробовать найти перевод во всех доступных БД? (Займет время)

source: Load all DB
ru_ru: Загрузка всех БД

source: getting translation:
ru_ru: получение перевода:

source: getting translation
ru_ru: получение перевода

source: Failed to open project
ru_ru: Не удалось открыть проект

source: Recent
ru_ru: Недавнее

source: contains
ru_ru: содержит

source: Select game exe or file to try to open
ru_ru: Выбрать exe игры или файл для открытия

source: Save DB
ru_ru: Сохранить БД

source: Save translated strings into database file
ru_ru: Сохранить переведенные строки в файл БД

source: Save DB to
ru_ru: Сохранить БД в

source: Save translated strings into database file into selected locatin
ru_ru: Сохранить переведенные строки в файл БД по выбранному пути

source: Write traslated strings back into source files
ru_ru: Записать переведенные строки обратно в исходные файлы

source: Out ain file creation was failed
ru_ru: Создание выходного ain файла не удалось

source: Try to run 'write.bat' manually and check console for errors
ru_ru: Попробуйте запустить файл 'write.bat' вручную и проверьте консоль на ошибки

source: Errors was occcured while packing
ru_ru: Произошла ошибка при упаковке

source: Will be opened log and work dir
ru_ru: Будет открыта рабочая папка

source: Creating translation patch
ru_ru: Создание патча перевода

source: Extraction
ru_ru: Извлечение

source: Proceed
ru_ru: Запуск

source: Calculate control crc
ru_ru: Посчитать crc32

source: Skipped:
ru_ru: Пропущен:

source: Found already extracted files
ru_ru: Найдены уже извлеченные файлы

source: Skip already extracted?
ru_ru: Пропустить уже узвлеченные?

source: Extract files from
ru_ru: Извлечение файлов из

source: Nothing to add
ru_ru: Нечего добавлять

source: finished
ru_ru: завершено

source: Resource extraction
ru_ru: Извлечение ресурсов

source: text extraction in csv
ru_ru: извлечение текста из csv

source: menu text extraction in csv
ru_ru: извлечение текста меню из csv

source: scripts extraction in lns
ru_ru: Извлечение скриптов из lns

source: write text
ru_ru: запись текста

source: write menus
ru_ru: запись меню

source: write scripts
ru_ru: запись скриптов

source: Copy lsb for insertion
ru_ru: копирование lsb для вставки

source: Inserting lsb in game
ru_ru: вставка lsb в игру

source: Opening
ru_ru: Открытие

source: restore
ru_ru: восстановление

source: backup
ru_ru: резервная копия

source: Skip JS
ru_ru: Пропуск JS

source: Add selected item to Skip.js file
ru_ru: Добавить выбранный файл в файл Skip.js для его пропуска при следующем открытии

source: Open SkipCodesList
ru_ru: Открыть список кодов команд для пропуска

source: write file:
ru_ru: запись файла:

source: opening file:
ru_ru: открытие файла:

source: Writing:
ru_ru: Запись:

source: saving file:
ru_ru: сохранение файла:

source: Writing
ru_ru: Запись

source: Restore baks
ru_ru: Восстановление bak

source: Patching
ru_ru: Патч

source: Error occured while patch execution. Error
ru_ru: Произошла ошибка при выполнении патча. Ошибка

source: Patching failed
ru_ru: Патч не удался

source: Somethig wrong
ru_ru: Что то случилось

source: Trying 2nd variant
ru_ru: Пробуем 2й вариант

source: Last try
ru_ru: Последняя попытка

source: Extracting
ru_ru: Извлечение

source: Error occured while patch execution.
ru_ru: Произошла ошибка при выполнении патча.

source: Patch creation finished unsuccesfully.
ru_ru: Создание патча не удалось

source: Work folder will be opened.
ru_ru: Будет открыта рабочая папка

source: Try to run Patch.cmd manually and check it for errors.
ru_ru: Попробуйте запустить файл 'Patch.cmd' вручную и проверьте консоль на ошибки

source: Create patch
ru_ru: Создание патча

source: Write patch
ru_ru: Запись патча

source: Extract
ru_ru: Извлечение

source: Trying again
ru_ru: Повторная попытка

source: Create buckup of original files
ru_ru: Создание резервных копий переведенных файлов

source: Replace translated files
ru_ru: Замена переведенных файлов

source: Found similar files. Open them too?
ru_ru: Найдены похожие файлы. Открыть их тоже?

source: Found files with same extension
ru_ru: Найдены файлы с тем же расширением
